app/controllers/carts_controller.rb

	def index
		@cart = Cart.where(status: "carted")
---
SELECT "carts".* FROM "carts" WHERE "carts"."status" = $1  [["status", "carted"]]

	def create
		product_id = params[:product_id]
		products = Product.where(id: product_id)

		if products.length > 0

			quantity = params[:quantity]
			@add_to_cart = Unirest.post "https://www.foodbylags.com/api_for_lags/create",
				headers:{ "Accept" => "application/json" },
				parameters:{
					:product_id => product_id,
					:quantity => quantity,
					:status => status
				}.to_json

		else
			flash[:info] = "Sorry, we are out of this product."
		end
		@add_to_cart.save
---
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "carts" ("user_id", "product_id", "quantity", "status", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 24], ["product_id", 2], ["quantity", 1], ["status", "carted"], ["created_at", "2017-08-03 20:35:19.054097"], ["updated_at", "2017-08-03 20:35:19.054097"]]

	def update
		@cart = Cart.find_by(id: params[:id])
		product_id = params[:product_id]
		product = Product.find_by(id: product_id)
		@cart.status = "Removed"
		@cart.save
---
SELECT  "carts".* FROM "carts" WHERE "carts"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
SELECT  "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "carts" SET "status" = $1, "updated_at" = $2 WHERE "carts"."id" = $3  [["status", "Removed"], ["updated_at", "2017-08-03 21:00:11.356762"], ["id", 6]]