app/controllers/charges_controller.rb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]
---
	def new
		@order = Order.last