app/controllers/charges_controller.rb

SELECT  "orders".* FROM "orders" ORDER BY "orders"."id" DESC LIMIT $1  [["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "orders".* FROM "orders" WHERE "orders"."id" IS NULL LIMIT $1  [["LIMIT", 1]]
---
	def create
		#amount in cents
		@order = Order.last
		@amount = @order.total * 100

		customer = Stripe::Customer.create(
			:email => params[:stripeEmail],
			:source	=> params[:stripeToken]
		)

		charge = Stripe::Charge.create(
			:customer => customer.id,
			:amount => @amount.to_i,
			:description => 'Rails Stripe Customer',
			:currency => 'usd'
		)

		@buyer = User.find_by(id: current_user.id)

		if charge.save
			OrderMailer.order_confirmation(@buyer).deliver