app/controllers/orders_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."status" = $2  [["user_id", 24], ["status", "carted"]]
INSERT INTO "orders" ("user_id", "subtotal", "tax", "total", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 24], ["subtotal", "80.0"], ["tax", "7.2"], ["total", "87.2"], ["created_at", "2017-08-03 21:52:39.724884"], ["updated_at", "2017-08-03 21:52:39.724884"]]
UPDATE "carts" SET "status" = $1, "order_id" = $2, "updated_at" = $3 WHERE "carts"."id" = $4  [["status", "Purchased"], ["order_id", 29], ["updated_at", "2017-08-03 22:18:21.320856"], ["id", 29]]
---
	def create
		@new_order = Cart.where(user_id: current_user.id,
								status: "carted")
		subtotal = 0
		@new_order.each do |cart_item|
			subtotal += (cart_item.product.cost * cart_item.quantity)
		end
		tax = subtotal * 0.09
		total = subtotal + tax
		@order = Order.new(user_id: current_user.id,
							  subtotal: subtotal,
							  tax: tax,
							  total: total)
		@new_order.each do |item|
			item.status = "Purchased"
			item.order_id = item.id
			item.save

SELECT  "orders".* FROM "orders" WHERE "orders"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
	def show
		@order = Order.find_by(id: params[:id])