app/controllers/orders_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."status" = $1  [["status", "carted"]]
---
	def create
		@new_order = Cart.where(status: "carted")