app/controllers/products_controller.rb

SELECT "products".* FROM "products"
SELECT "carts".* FROM "carts" WHERE "carts"."user_id" = $1 AND "carts"."status" = $2  [["user_id", 24], ["status", "carted"]]
---
	def index
		@products = Product.all
		if current_user
			@cart = current_user.carts.where(status: "carted")

INSERT INTO "products" ("name", "product_type", "stock", "cost", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "CookBook"], ["product_type", "Book"], ["stock", 100], ["cost", "40.0"], ["created_at", "2017-08-01 14:36:03.464084"], ["updated_at", "2017-08-01 14:36:03.464084"]]
---
	def create
		name = params[:name]
		product_type = params[:product_type]
		stock = params[:stock]
		cost = params[:cost]
		item = Product.new(name: name, product_type: product_type, stock: stock, cost: cost)
		item.save