app/controllers/sessions_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]
---
	def admin_signin
		user = User.find_by(email: params[:email])

SELECT  "users".* FROM "users" WHERE "users"."email" = $1 LIMIT $2  [["email", "jjimmy@gmail"], ["LIMIT", 1]]
---
	def signin
		user = User.find_by(email: params[:email])