app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "address", "admin", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
	def create
		ship_one = params[:address_one]
		ship_two = params[:address_two]
		if ship_one && ship_two
			shippingaddress = ship_one + " " + ship_two
		elsif
			shippingaddress = ship_one
		end
		@user = User.new(first_name: params[:first_name],
						 last_name: params[:last_name],
						 email: params[:email],
						 address: shippingaddress,
						 password: params[:password],
						 password_confirmation: params[:password_confirmation],
						 admin: params[:admin])
		@user.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "last_name" = $1, "address" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["last_name", "Appleseeder"], ["address", "1234 Cherry Way Treesgrowingheresville, CA 93443 Apt Tree"], ["updated_at", "2017-08-03 19:00:40.389484"], ["id", 25]]
---
	def update
		@user = User.find_by(id: current_user.id)
		@user.first_name = params[:first_name]
		@user.last_name = params[:last_name]
		ship_one = params[:address_one]
		ship_two = params[:address_two]
		if ship_one && ship_two
			shippingaddress = ship_one + " " + ship_two
		else
			shippingaddress = ship_one
		end
		@user.address = shippingaddress
		@user.save